Revit 2026 API

# ScheduleDefinitionGrandTotalTitle Property

---

The title name is used to display at the grand total row. The name is "Grand total", expressed in the Revit session language, by default.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GrandTotalTitle { get; set; }
```
```vb
Public Property GrandTotalTitle As String
	Get
	Set
```
```cpp
public:
property String^ GrandTotalTitle {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member GrandTotalTitle : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: Display of a grand total row is not enabled. -or- When setting this property: Display of grand total title is not enabled. |

GrandTotalTitle can only be set when both ShowGrandTotal and ShowGrandTotalTitle are enabled.

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace